In [1]:
# Add the Pandas dependency.
import pandas as pd

In [2]:
# Files to load
school_data_to_load = "resources/schools_complete.csv"
student_data_to_load = "resources/students_complete.csv"
# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)

In [3]:
# Determine the school type.
per_school_types = school_data_df.set_index(["school_name"])["type"]
per_school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [4]:
# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head(4)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635

In [5]:
school_data_complete_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39170 entries, 0 to 39169
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     39170 non-null  int64
 1   student_name   39170 non-null  object
 2   gender         39170 non-null  object
 3   grade          39170 non-null  object
 4   school_name    39170 non-null  object
 5   reading_score  39170 non-null  int64
 6   math_score     39170 non-null  int64
 7   School ID      39170 non-null  int64
 8   type           39170 non-null  object
 9   size           39170 non-null  int64
 10  budget         39170 non-null  int64
dtypes: int64(6), object(5)
memory usage: 3.6+ MB

In [7]:
#Thomas High School Students DataFrrame
school_thomas_allgrade_df = school_data_complete_df.loc[(school_data_complete_df["school_name"] == "Thomas High School")]
school_thomas_allgrade_df.head(5)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
37535,37535,Norma Mata,F,10th,Thomas High School,76,76,14,Charter,1635,1043130
37536,37536,Cody Miller,M,11th,Thomas High School,84,82,14,Charter,1635,1043130
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90,14,Charter,1635,1043130
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,69,14,Charter,1635,1043130
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76,14,Charter,1635,1043130

In [8]:
school_thomas_allgrade_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1635 entries, 37535 to 39169
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     1635 non-null   int64
 1   student_name   1635 non-null   object
 2   gender         1635 non-null   object
 3   grade          1635 non-null   object
 4   school_name    1635 non-null   object
 5   reading_score  1635 non-null   int64
 6   math_score     1635 non-null   int64
 7   School ID      1635 non-null   int64
 8   type           1635 non-null   object
 9   size           1635 non-null   int64
 10  budget         1635 non-null   int64
dtypes: int64(6), object(5)
memory usage: 153.3+ KB

In [100]:
Thomas_school_type =school_thomas_allgrade_df.head(1)["type"].head(1)

Thomas_school_type

37535    Charter
Name: type, dtype: object

In [101]:
Thomas_school_budget =  school_thomas_allgrade_df["budget"].head(1)
Thomas_school_budget

37535    1043130
Name: budget, dtype: int64

In [102]:
per_stu_Thomas_school_budget = Thomas_school_budget/1635
per_stu_Thomas_school_budget

37535    638.0
Name: budget, dtype: float64

In [103]:
#Total Students in Thomas High School Students DataFrrame
total_students_thomas_high = school_thomas_allgrade_df["Student ID"].count()
total_students_thomas_high

1635

In [104]:
#Step 1, using the loc method with logical and comparison operators, retrieve the student count for 
#Thomas High School ninth graders in the school_data_complete_df 
#student_data_df.loc[(student_data_df["reading_score"] >=70) & (student_data_df["math_score"] >= 70)]
school_thomas_ninthgrade_df = school_data_complete_df.loc[(school_data_complete_df["grade"] == "9th") & (school_data_complete_df["school_name"] == "Thomas High School")]
school_thomas_ninthgrade_df.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90,14,Charter,1635,1043130
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,69,14,Charter,1635,1043130
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76,14,Charter,1635,1043130
37540,37540,Austin Meyer,M,9th,Thomas High School,73,96,14,Charter,1635,1043130
37543,37543,Madison Hampton,F,9th,Thomas High School,82,73,14,Charter,1635,1043130
37550,37550,Patricia Diaz,F,9th,Thomas High School,76,99,14,Charter,1635,1043130
37558,37558,Kelly Henderson,M,9th,Thomas High School,81,90,14,Charter,1635,1043130
37559,37559,Kiara Bates,F,9th,Thomas High School,72,98,14,Charter,1635,1043130
37562,37562,Teresa Johns,F,9th,Thomas High School,86,69,14,Charter,1635,1043130
37564,37564,Stephen Patrick,M,9th,Thomas High School,93,97,14,Charter,1635,1043130

In [107]:
school_thomas_ninthgrade_count = school_thomas_ninthgrade_df["Student ID"].count()
school_thomas_ninthgrade_count

461

In [108]:
thomas_ninthgrade_averagemath_score = (school_thomas_ninthgrade_df["math_score"].sum())/school_thomas_ninthgrade_count
thomas_ninthgrade_averagemath_score

83.59002169197397

In [109]:
thomas_ninthgrade_averagereading_score = (school_thomas_ninthgrade_df["reading_score"].sum())/school_thomas_ninthgrade_count
thomas_ninthgrade_averagereading_score

83.72885032537961

In [110]:
thomas_ninthgrade_per_passmath = ((school_thomas_ninthgrade_df["math_score"] >= 70) == True).value_counts()
thomas_ninthgrade_per_passmath

True     431
False     30
Name: math_score, dtype: int64

In [111]:
#Thomas school 9th grade students passing math 
math_pass_thomas_ninenth =  thomas_ninthgrade_per_passmath[True]
math_pass_thomas_ninenth

431

In [112]:
#percentage of students passing math 
per_thomas_ninth_grade_passing_math = math_pass_thomas_ninenth/school_thomas_ninthgrade_count*100
per_thomas_ninth_grade_passing_math

93.49240780911063

In [113]:
thomas_ninthgrade_per_passreading = ((school_thomas_ninthgrade_df["reading_score"] >= 70) == True).value_counts()
thomas_ninthgrade_per_passreading

True     452
False      9
Name: reading_score, dtype: int64

In [114]:
#Thomas school 9th grade students passing reading 
reading_pass_thomas_ninenth =  thomas_ninthgrade_per_passreading[True]
reading_pass_thomas_ninenth

452

In [115]:
#percentage of students passing reading 
per_thomas_ninth_grade_passing_reading = reading_pass_thomas_ninenth/school_thomas_ninthgrade_count*100
per_thomas_ninth_grade_passing_reading

98.0477223427332

In [116]:
#overall passing in reading & math count
thomas_ninthgrade_per_passreading_passmath = ((school_thomas_ninthgrade_df["math_score"] >= 70) & (school_thomas_ninthgrade_df["reading_score"] >= 70)).value_counts()
thomas_ninthgrade_per_passreading_passmath

True     423
False     38
dtype: int64

In [117]:
#overallpass percentage
overall_thomas_ninth_pass_per = thomas_ninthgrade_per_passreading_passmath[True]/school_thomas_ninthgrade_count*100
overall_thomas_ninth_pass_per

91.75704989154013

In [120]:
thomas_school_ninth_summary_df = pd.DataFrame({
             "School Type": Thomas_school_type,
             "Total Students": [total_students_thomas_high],
             "Total School Budget": Thomas_school_budget,
             "Per Student Budget": per_stu_Thomas_school_budget,
             "Average Math Score": [thomas_ninthgrade_averagemath_score],
           "Average Reading Score": [thomas_ninthgrade_averagereading_score],
           "% Passing Math": [per_thomas_ninth_grade_passing_math],
           "% Passing Reading": [per_thomas_ninth_grade_passing_reading],
           "% Overall Passing": [overall_thomas_ninth_pass_per]})
thomas_school_ninth_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
37535,Charter,1635,1043130,638.0,83.590022,83.72885,93.492408,98.047722,91.75705